joristork/robots/jobot_in_c/microchip_extras/h/p18f83j90.h
extern volatile near unsigned char       BAUDCON1;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned :1;
    unsigned BRG16:1;
    unsigned TXCKP:1;
    unsigned RXDTP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
    unsigned :1;
    unsigned RCMT:1;
  };
} BAUDCON1bits;
extern volatile near unsigned char       SPBRGH1;
extern volatile near unsigned char       PORTA;
extern volatile near union {
  struct {
    unsigned RA0:1;
    unsigned RA1:1;
    unsigned RA2:1;
    unsigned RA3:1;
    unsigned RA4:1;
    unsigned RA5:1;
    unsigned RA6:1;
    unsigned RA7:1;
  };
  struct {
    unsigned AN0:1;
    unsigned AN1:1;
    unsigned AN2:1;
    unsigned AN3:1;
    unsigned T0CKI:1;
    unsigned AN4:1;
    unsigned OSC2:1;
    unsigned OSC1:1;
  };
  struct {
    unsigned :1;
    unsigned SEG18:1;
    unsigned VREFM:1;
    unsigned VREFP:1;
    unsigned SEG14:1;
    unsigned SEG15:1;
    unsigned CLKO:1;
    unsigned CLKI:1;
  };
} PORTAbits;
extern volatile near unsigned char       PORTB;
extern volatile near union {
  struct {
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RB2:1;
    unsigned RB3:1;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned RB6:1;
    unsigned RB7:1;
  };
  struct {
    unsigned INT0:1;
    unsigned INT1:1;
    unsigned INT2:1;
    unsigned INT3:1;
    unsigned KBI0:1;
    unsigned KBI1:1;
    unsigned KBI2:1;
    unsigned KBI3:1;
  };
  struct {
    unsigned SEG30:1;
    unsigned SEG8:1;
    unsigned SEG9:1;
    unsigned SEG10:1;
    unsigned SEG11:1;
    unsigned SEG29:1;
    unsigned PGC:1;
    unsigned PGD:1;
  };
} PORTBbits;
extern volatile near unsigned char       PORTC;
extern volatile near union {
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned RC4:1;
    unsigned RC5:1;
    unsigned RC6:1;
    unsigned RC7:1;
  };
  struct {
    unsigned T1OSO:1;
    unsigned T1OSI:1;
    unsigned :1;
    unsigned SCL:1;
    unsigned SDA:1;
    unsigned :1;
    unsigned CK1:1;
    unsigned DT1:1;
  };
  struct {
    unsigned T13CKI:1;
    unsigned CCP2:1;
    unsigned CCP1:1;
    unsigned SCK:1;
    unsigned SDI:1;
    unsigned SDO:1;
    unsigned TX1:1;
    unsigned RX1:1;
  };
  struct {
    unsigned :1;
    unsigned SEG32:1;
    unsigned SEG13:1;
    unsigned SEG17:1;
    unsigned SEG16:1;
    unsigned SEG12:1;
    unsigned SEG27:1;
    unsigned SEG28:1;
  };
} PORTCbits;
extern volatile near unsigned char       PORTD;
extern volatile near union {
  struct {
    unsigned RD0:1;
    unsigned RD1:1;
    unsigned RD2:1;
    unsigned RD3:1;
    unsigned RD4:1;
    unsigned RD5:1;
    unsigned RD6:1;
    unsigned RD7:1;
  };
  struct {
    unsigned SEG0:1;
    unsigned SEG1:1;
    unsigned SEG2:1;
    unsigned SEG3:1;
    unsigned SEG4:1;
    unsigned SEG5:1;
    unsigned SEG6:1;
    unsigned SEG7:1;
  };
} PORTDbits;
extern volatile near unsigned char       PORTE;
extern volatile near union {
  struct {
    unsigned RE0:1;
    unsigned RE1:1;
    unsigned :1;
    unsigned RE3:1;
    unsigned RE4:1;
    unsigned RE5:1;
    unsigned RE6:1;
    unsigned RE7:1;
  };
  struct {
    unsigned LCDBIAS1:1;
    unsigned LCDBIAS2:1;
    unsigned :1;
    unsigned COM0:1;
    unsigned COM1:1;
    unsigned COM2:1;
    unsigned COM3:1;
    unsigned CCP2:1;
  };
  struct {
    unsigned :7;
    unsigned SEG31:1;
  };
} PORTEbits;
extern volatile near unsigned char       PORTF;
extern volatile near union {
  struct {
    unsigned :1;
    unsigned RF1:1;
    unsigned RF2:1;
    unsigned RF3:1;
    unsigned RF4:1;
    unsigned RF5:1;
    unsigned RF6:1;
    unsigned RF7:1;
  };
  struct {
    unsigned :1;
    unsigned AN6:1;
    unsigned AN7:1;
    unsigned AN8:1;
    unsigned AN9:1;
    unsigned AN10:1;
    unsigned AN11:1;
    unsigned AN5:1;
  };
  struct {
    unsigned :1;
    unsigned C2OUT:1;
    unsigned C1OUT:1;
    unsigned C2INB:1;
    unsigned C2INA:1;
    unsigned C1INB:1;
    unsigned C1INA:1;
    unsigned SS1:1;
  };
  struct {
    unsigned :1;
    unsigned SEG19:1;
    unsigned SEG20:1;
    unsigned SEG21:1;
    unsigned SEG22:1;
    unsigned SEG23:1;
    unsigned SEG24:1;
    unsigned SEG25:1;
  };
  struct {
    unsigned :5;
    unsigned CVREF:1;
  };
} PORTFbits;
extern volatile near unsigned char       PORTG;
extern volatile near union {
  struct {
    unsigned RG0:1;
    unsigned RG1:1;
    unsigned RG2:1;
    unsigned RG3:1;
    unsigned RG4:1;
    unsigned RJPU:1;
    unsigned REPU:1;
    unsigned RDPU:1;
  };
  struct {
    unsigned LCDBIAS0:1;
    unsigned CK2:1;
    unsigned DT2:1;
    unsigned VLCAP2:1;
    unsigned SEG26:1;
  };
  struct {
    unsigned :1;
    unsigned TX2:1;
    unsigned RX2:1;
  };
  struct {
    unsigned :2;
    unsigned VLCAP1:1;
  };
} PORTGbits;
extern volatile near unsigned char       PORTH;
extern volatile near union {
  struct {
    unsigned RH0:1;
    unsigned RH1:1;
    unsigned RH2:1;
    unsigned RH3:1;
    unsigned RH4:1;
    unsigned RH5:1;
    unsigned RH6:1;
    unsigned RH7:1;
  };
  struct {
    unsigned SEG47:1;
    unsigned SEG46:1;
    unsigned SEG45:1;
    unsigned SEG44:1;
    unsigned SEG40:1;
    unsigned SEG41:1;
    unsigned SEG42:1;
    unsigned SEG43:1;
  };
} PORTHbits;
extern volatile near unsigned char       PORTJ;
extern volatile near union {
  struct {
    unsigned RJ0:1;
    unsigned RJ1:1;
    unsigned RJ2:1;
    unsigned RJ3:1;
    unsigned RJ4:1;
    unsigned RJ5:1;
    unsigned RJ6:1;
    unsigned RJ7:1;
  };
  struct {
    unsigned :1;
    unsigned SEG33:1;
    unsigned SEG34:1;
    unsigned SEG35:1;
    unsigned SEG39:1;
    unsigned SEG38:1;
    unsigned SEG37:1;
    unsigned SEG36:1;
  };
} PORTJbits;
